# Pandas 2

In [1]:
import pandas as pd
import numpy as np

In [2]:
data = [['Indah',20],['Fitrotul',21],['Aini',19]]
df2 = pd.DataFrame(data,columns=['Nama','Usia'])
print(df2)

       Nama  Usia
0     Indah    20
1  Fitrotul    21
2      Aini    19

In [3]:
df2["Nama"]

0       Indah
1    Fitrotul
2        Aini
Name: Nama, dtype: object

In [4]:
df2["Usia"]

0    20
1    21
2    19
Name: Usia, dtype: int64

In [5]:
df2["Nama"][0]

'Indah'

In [6]:
df2.iloc[0][0]

'Indah'

In [7]:
df2.loc[0]["Nama"]

'Indah'

In [8]:
df2.at[0,"Nama"]

'Indah'

In [9]:
df2.iat[0,0]

'Indah'

In [10]:
df2.iloc[0]

Nama    Indah
Usia       20
Name: 0, dtype: object

In [11]:
df2.loc[:,'Nama']

0       Indah
1    Fitrotul
2        Aini
Name: Nama, dtype: object

# Set Index

In [12]:
df3 = pd.DataFrame([['Indah',20],['Fitrotul',21],['Aini',19]],columns=['Nama','Usia'])
df3

       Nama  Usia
0     Indah    20
1  Fitrotul    21
2      Aini    19

In [13]:
df3.set_index("Nama")

          Usia
Nama
Indah       20
Fitrotul    21
Aini        19

# Pemanggilan Baris

In [14]:
df4 = pd.DataFrame(data=np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]]), index= [2, 'A', 4], columns=[48, 49, 50])
df4

   48  49  50
2   1   2   3
A   4   5   6
4   7   8   9

In [15]:
df4.loc[2]

48    1
49    2
50    3
Name: 2, dtype: int32

In [16]:
df4.iloc[2]

48    7
49    8
50    9
Name: 4, dtype: int32

# Menambah Kolom

In [20]:
df5 = pd.DataFrame([['Indah',20],['Fitrotul',21],['Aini',19]],columns=['Nama','Usia'])
df5["Index"]=df5.index
df5

       Nama  Usia  Index
0     Indah    20      0
1  Fitrotul    21      1
2      Aini    19      2

In [29]:
df5 = pd.DataFrame([['Indah',20],['Fitrotul',21],['Aini',19]],columns=['Nama','Usia'])
df5["Index"]=df5.index
df5.loc[:, "Gender"] = pd.Series(['P','P','P'])
df5

       Nama  Usia  Index Gender
0     Indah    20      0      P
1  Fitrotul    21      1      P
2      Aini    19      2      P

# Melihat Ukuran DataFrame

In [30]:
len(df2)

3

In [31]:
len(df2["Nama"])

3

In [32]:
print(df2.shape)

(3, 2)

# Menghapus

In [33]:
df6 = pd.DataFrame([['Indah',20],['Fitrotul',21],['Aini',19]],columns=['Nama','Usia'])
df6

       Nama  Usia
0     Indah    20
1  Fitrotul    21
2      Aini    19

In [34]:
del df6['Nama']
df6

   Usia
0    20
1    21
2    19

In [35]:
df6=df6[2:]
df6

   Usia
2    19

In [36]:
df6 = pd.DataFrame([['Indah',20],['Fitrotul',21],['Aini',19]],columns=['Nama','Usia'])
df6

       Nama  Usia
0     Indah    20
1  Fitrotul    21
2      Aini    19

In [37]:
df6=df6.drop(df6.index[[0,2]])
df6

       Nama  Usia
1  Fitrotul    21